g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/src/stm32f7xx_usart.c
/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_usart.h"
#include "stm32f7xx_rcc.h"

/** @addtogroup STM32F7xx_StdPeriph_Driver
  * @{
  */

/** @defgroup USART 
  * @brief USART driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/*!< USART CR1 register clear Mask ((~(uint32_t)0xFFFFE6F3)) */
#define CR1_CLEAR_MASK            ((uint32_t)(USART_CR1_M | USART_CR1_PCE | \
                                              USART_CR1_PS | USART_CR1_TE | \
                                              USART_CR1_RE))

/*!< USART CR2 register clock bits clear Mask ((~(uint32_t)0xFFFFF0FF)) */
#define CR2_CLOCK_CLEAR_MASK      ((uint32_t)(USART_CR2_CLKEN | USART_CR2_CPOL | \
                                              USART_CR2_CPHA | USART_CR2_LBCL))

/*!< USART CR3 register clear Mask ((~(uint32_t)0xFFFFFCFF)) */
#define CR3_CLEAR_MASK            ((uint32_t)(USART_CR3_RTSE | USART_CR3_CTSE))

/*!< USART Interrupts mask */
#define IT_MASK                   ((uint32_t)0x000000FF)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup USART_Private_Functions
  * @{
  */

/** @defgroup USART_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions 
 *
@verbatim   
 ===============================================================================
          ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]
        This subsection provides a set of functions allowing to initialize the USART 
        in asynchronous and in synchronous modes.
        (+) For the asynchronous mode only these parameters can be configured: 
          (++) Baud Rate.
          (++) Word Length.
          (++) Stop Bit.
          (++) Parity: If the parity is enabled, then the MSB bit of the data written
               in the data register is transmitted but is changed by the parity bit.
               Depending on the frame length defined by the M bit (8-bits or 9-bits),
               the possible USART frame formats are as listed in the following table:

   +-------------------------------------------------------------+     
   |   M bit |  PCE bit  |            USART frame                |
   |---------------------|---------------------------------------|             
   |    0    |    0      |    | SB | 8 bit data | STB |          |
   |---------|-----------|---------------------------------------|  
   |    0    |    1      |    | SB | 7 bit data | PB | STB |     |
   |---------|-----------|---------------------------------------|  
   |    1    |    0      |    | SB | 9 bit data | STB |          |
   |---------|-----------|---------------------------------------|  
   |    1    |    1      |    | SB | 8 bit data | PB | STB |     |
   +-------------------------------------------------------------+            

          (++) Hardware flow control.
          (++) Receiver/transmitter modes.
    [..] The USART_Init() function follows the USART  asynchronous configuration 
         procedure(details for the procedure are available in reference manual.
        (+) For the synchronous mode in addition to the asynchronous mode parameters
            these parameters should be also configured:
            (++) USART Clock Enabled.
            (++) USART polarity.
            (++) USART phase.
            (++) USART LastBit.
    [..] These parameters can be configured using the USART_ClockInit() function.

@endverbatim
  * @{
  */
  
/**
  * @brief  Deinitializes the USARTx peripheral registers to their default reset values.
  * @param  USARTx/UARTy: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  *                       where y can be 4, 5, 7 or 8 to select the USART peripheral.
  * @retval None
  */
void USART_DeInit(USART_TypeDef* USARTx)
{
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));

  if (USARTx == USART1)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_USART1, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_USART1, DISABLE);
  }
  else if (USARTx == USART2)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_USART2, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_USART2, DISABLE);
  }
  else if (USARTx == USART3)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_USART3, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_USART3, DISABLE);
  }
  else if (USARTx == UART4)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART4, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART4, DISABLE);
  }
  else if (USARTx == UART5)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART5, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART5, DISABLE);
  }
  else if (USARTx == USART6)
  {
    RCC_APB1PeriphResetCmd(RCC_APB2Periph_USART6, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB2Periph_USART6, DISABLE);
  }
  else if (USARTx == UART7)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART7, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART7, DISABLE);
  }
  else if (USARTx == UART8)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART8, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_UART8, DISABLE);
  }
}

/**
  * @brief  Get USARTx clock source
  * @param  USARTx/UARTy: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  *                       where y can be 4, 5, 7 or 8 to select the USART peripheral.
  * @retval        USART_CLOCKSOURCE_PCLK1:     USARTx use PCLK1 clock source
  *                USART_CLOCKSOURCE_PCLK2:     USARTx use PCLK2 clock source
  *                USART_CLOCKSOURCE_HSI:       USARTx use HSI clock source
  *                USART_CLOCKSOURCE_SYSCLK:    USARTx use SYSCLK clock source 
  *                USART_CLOCKSOURCE_LSE:       USARTx use LSE clock source
  *                USART_CLOCKSOURCE_UNDEFINED: Undefined clock source
  */
USART_ClockSourceTypeDef USART_GetClockSource(USART_TypeDef* USARTx)
{
  USART_ClockSourceTypeDef clocksource = USART_CLOCKSOURCE_UNDEFINED;
    
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  
  if (USARTx == USART1)
  {
    if( IS_USART1_CLKSOURCE_PCLK2() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK2;
    }
    else if( IS_USART1_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_USART1_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_USART1_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == USART2)
  {
    if( IS_USART2_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_USART2_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_USART2_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_USART2_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == USART3)
  {
    if( IS_USART3_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_USART3_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_USART3_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_USART3_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == UART4)
  {
    if( IS_UART4_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_UART4_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_UART4_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_UART4_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == UART5)
  {
    if( IS_UART5_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_UART5_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_UART5_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_UART5_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == USART6)
  {
    if( IS_USART6_CLKSOURCE_PCLK2() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK2;
    }
    else if( IS_USART6_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_USART6_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_USART6_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == UART7)
  {
    if( IS_UART7_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_UART7_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_UART7_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_UART7_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  else if (USARTx == UART8)
  {
    if( IS_UART8_CLKSOURCE_PCLK1() )
    {
      clocksource = USART_CLOCKSOURCE_PCLK1;
    }
    else if( IS_UART8_CLKSOURCE_SYSCLK() )
    {
      clocksource = USART_CLOCKSOURCE_SYSCLK;
    }
    else if( IS_UART8_CLKSOURCE_HSI() )
    {
      clocksource = USART_CLOCKSOURCE_HSI;
    }
    else if( IS_UART8_CLKSOURCE_LSE() )
    {
      clocksource = USART_CLOCKSOURCE_LSE;
    }
  }
  
  return clocksource;
}

/**
  * @brief  Initializes the USARTx peripheral according to the specified
  *         parameters in the USART_InitStruct .
  * @param  USARTx/UARTy: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  *                       where y can be 4, 5, 7 or 8 to select the USART peripheral.
  * @note   USART3 and USART4 are available only for STM32F072 devices.
  * @note   USART2 is not available for STM32F031 devices.    
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that contains
  *         the configuration information for the specified USART peripheral.
  * @retval None
  */
void USART_Init(USART_TypeDef* USARTx, USART_InitTypeDef* USART_InitStruct)
{
  uint32_t divider = 0, apbclock = 0, tmpreg = 0;
  RCC_ClocksTypeDef RCC_ClocksStatus;
  USART_ClockSourceTypeDef clocksource = USART_CLOCKSOURCE_UNDEFINED;
  
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  assert_param(IS_USART_BAUDRATE(USART_InitStruct->USART_BaudRate));  
  assert_param(IS_USART_WORD_LENGTH(USART_InitStruct->USART_WordLength));
  assert_param(IS_USART_STOPBITS(USART_InitStruct->USART_StopBits));
  assert_param(IS_USART_PARITY(USART_InitStruct->USART_Parity));
  assert_param(IS_USART_MODE(USART_InitStruct->USART_Mode));
  assert_param(IS_USART_HARDWARE_FLOW_CONTROL(USART_InitStruct->USART_HardwareFlowControl));
  
  /* Disable USART */
  USARTx->CR1 &= (uint32_t)~((uint32_t)USART_CR1_UE);
  
  /*---------------------------- USART CR2 Configuration -----------------------*/
  tmpreg = USARTx->CR2;
  /* Clear STOP[13:12] bits */
  tmpreg &= (uint32_t)~((uint32_t)USART_CR2_STOP);
  
